atomvm/AtomVM/src/platforms/esp32/main/socket_driver.c
    return udp_data;
}

static void send_message(term pid, term message, GlobalContext *global)
{
    int local_process_id = term_to_local_process_id(pid);
    Context *target = globalcontext_get_process(global, local_process_id);
    mailbox_send(target, message);
}

void ESP_IRAM_ATTR socket_callback(struct netconn *netconn, enum netconn_evt evt, u16_t len)
{
    struct NetconnEvent event = {
        .netconn = netconn,
        .evt = evt,
        .len = len
    };

    BaseType_t xHigherPriorityTaskWoken;
    int result = xQueueSendFromISR(netconn_events, &event, &xHigherPriorityTaskWoken);
    if (result != pdTRUE) {
        fprintf(stderr, "socket: failed to enqueue: %i to netconn_events.\n", result);
    }

    void *netconn_events_ptr = &netconn_events;
    result = xQueueSendFromISR(event_queue, &netconn_events_ptr, &xHigherPriorityTaskWoken);
    if (result != pdTRUE) {
        fprintf(stderr, "socket: failed to enqueue: %i to event_queue.\n", result);
    }
}

void accept_conn(struct TCPServerAccepter *accepter, Context *ctx)
{
    TRACE("Going to accept a TCP connection\n");

    struct TCPServerSocketData *tcp_data = ctx->platform_data;
    GlobalContext *glb = ctx->global;
    struct ESP32PlatformData *platform = glb->platform_data;

    struct netconn *accepted_conn;
    err_t status = netconn_accept(tcp_data->socket_data.conn, &accepted_conn);
    if (UNLIKELY(status != ERR_OK)) {
        //TODO
        fprintf(stderr, "accept error: %i on %p\n", status, (void *) tcp_data->socket_data.conn);
        return;
    }

    term pid = accepter->accepting_process_pid;

    TRACE("accepted conn: %p\n", accepted_conn);

    Context *new_ctx = context_new(glb);
    new_ctx->native_handler = socket_consume_mailbox;
    scheduler_make_waiting(glb, new_ctx);

    term socket_pid = term_from_local_process_id(new_ctx->process_id);

    struct TCPClientSocketData *new_tcp_data = tcp_client_socket_data_new(new_ctx, accepted_conn, platform, pid);
    if (IS_NULL_PTR(new_tcp_data)) {
        abort();
    }

    //TODO
    if (UNLIKELY(memory_ensure_free(ctx, 128) != MEMORY_GC_OK)) {
        abort();
    }
    term ref = term_from_ref_ticks(accepter->ref_ticks, ctx);
    term return_tuple = term_alloc_tuple(2, ctx);

    free(accepter);

    term result_tuple = term_alloc_tuple(2, ctx);
    term_put_tuple_element(result_tuple, 0, OK_ATOM);
    term_put_tuple_element(result_tuple, 1, socket_pid);

    term_put_tuple_element(return_tuple, 0, ref);
    term_put_tuple_element(return_tuple, 1, result_tuple);

    send_message(pid, return_tuple, glb);
}

static void do_accept(Context *ctx, term msg)
{
    struct TCPServerSocketData *tcp_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    struct TCPServerAccepter *accepter = malloc(sizeof(struct TCPServerAccepter));
    accepter->accepting_process_pid = pid;
    accepter->ref_ticks = term_to_ref_ticks(ref);
    list_append(&tcp_data->accepters_list_head, &accepter->accepter_head);

    if (tcp_data->ready_connections) {
        TRACE("accepting existing connections.\n");

        struct ListHead *accepter_head;
        struct ListHead *tmp;
        struct TCPServerAccepter *accepter = NULL;
        MUTABLE_LIST_FOR_EACH (accepter_head, tmp, &tcp_data->accepters_list_head) {
            //TODO: check if is alive here
            if (1) {
                accepter = GET_LIST_ENTRY(accepter_head, struct TCPServerAccepter, accepter_head);
                list_remove(accepter_head);
            }
        }

        if (accepter) {
            accept_conn(accepter, ctx);
            tcp_data->ready_connections--;
        }
    }
}

static void close_tcp_socket(Context *ctx, struct TCPClientSocketData *tcp_data)
{
    if (UNLIKELY(memory_ensure_free(ctx, 3) != MEMORY_GC_OK)) {
        abort();
    }
    term pid = tcp_data->socket_data.controlling_process_pid;
    term msg = term_alloc_tuple(2, ctx);
    term_put_tuple_element(msg, 0, TCP_CLOSED_ATOM);
    term_put_tuple_element(msg, 1, term_from_local_process_id(pid));

    err_t res = netconn_delete(tcp_data->socket_data.conn);
    if (res != ERR_OK) {
        TRACE("close_tcp_socket: netconn_delete failed");
    }
    tcp_data->socket_data.conn = NULL;
    list_remove(&tcp_data->socket_data.sockets_head);

    free(tcp_data);

    send_message(pid, msg, ctx->global);
    scheduler_terminate(ctx);

    return;
}

static void tcp_client_handler(Context *ctx)
{
    TRACE("tcp_client_handler\n");

    struct TCPClientSocketData *tcp_data = ctx->platform_data;
    GlobalContext *glb = ctx->global;

    if (!tcp_data->socket_data.active) {
        TRACE("tcp_client_handler: Not active socket.  Ignoring.\n");
        return;
    }

    if (!tcp_data->socket_data.avail_bytes) {
        TRACE("tcp_client_handler: No bytes to receive.\n");
        // NB. When the connection peer closes a connection, then no avail_bytes
        // are reported.  We verify that this is the expected behavior.
        close_tcp_socket(ctx, tcp_data);
        return;
    }

    struct netbuf *buf = NULL;
    err_t status = netconn_recv(tcp_data->socket_data.conn, &buf);
    if (UNLIKELY(status != ERR_OK)) {
        TRACE("tcp_client_handler: netconn_recv error: %i\n", status);
        close_tcp_socket(ctx, tcp_data);
        return;
    }

    void *data;
    u16_t data_len;
    status = netbuf_data(buf, &data, &data_len);
    if (UNLIKELY(status != ERR_OK)) {
        TRACE("tcp_client_handler: netbuf_data error: %i\n", status);
        close_tcp_socket(ctx, tcp_data);
        return;
    }

    tcp_data->socket_data.avail_bytes -= data_len;

    //HANDLE fragments here?

    TRACE("%*s\n", (int) data_len, (char *) data);

    int recv_terms_size;
    if (tcp_data->socket_data.binary) {
        recv_terms_size = term_binary_data_size_in_terms(data_len) + BINARY_HEADER_SIZE;
    } else {
        recv_terms_size = data_len * 2;
    }

    int tuples_size;
    if (tcp_data->socket_data.active) {
        // tuples_size = 5 (result_tuple size)
        tuples_size = 4;
    } else {
        // tuples_size = 3 (ok_tuple size) + 3 (result_tuple size)
        tuples_size = 3 + 3;
    }
    if (UNLIKELY(memory_ensure_free(ctx, tuples_size + recv_terms_size) != MEMORY_GC_OK)) {
        abort();
    }

    term recv_data;
    if (tcp_data->socket_data.binary) {
        recv_data = term_create_uninitialized_binary(data_len, ctx);
        memcpy((void *) term_binary_data(recv_data), data, data_len);
    } else {
        recv_data = term_from_string((const uint8_t *) data, data_len, ctx);
    }

    netbuf_delete(buf);

    term pid = tcp_data->socket_data.controlling_process_pid;

    term result_tuple;
    if (tcp_data->socket_data.active) {
        result_tuple = term_alloc_tuple(3, ctx);
        term_put_tuple_element(result_tuple, 0, TCP_ATOM);
        term_put_tuple_element(result_tuple, 1, term_from_local_process_id(ctx->process_id));
        term_put_tuple_element(result_tuple, 2, recv_data);

    } else {
        term ok_tuple = term_alloc_tuple(2, ctx);
        term_put_tuple_element(ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(ok_tuple, 1, recv_data);

        result_tuple = term_alloc_tuple(2, ctx);
        term_put_tuple_element(result_tuple, 0, term_from_ref_ticks(tcp_data->socket_data.passive_ref_ticks, ctx));
        term_put_tuple_element(result_tuple, 1, ok_tuple);

        pid = tcp_data->socket_data.passive_receiver_process_pid;

