atomvm/AtomVM/src/platforms/esp32/main/socket_driver.c
static void do_close(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct TCPServerSocketData *tcp_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    err_t res = netconn_delete(tcp_data->socket_data.conn);
    if (res != ERR_OK) {
        TRACE("socket: close failed");
        return;
    }
    //TODO
    tcp_data->socket_data.conn = NULL;
    list_remove(&tcp_data->socket_data.sockets_head);

    if (UNLIKELY(memory_ensure_free(ctx, 3) != MEMORY_GC_OK)) {
        abort();
    }
    term return_tuple = term_alloc_tuple(2, ctx);

    term_put_tuple_element(return_tuple, 0, ref);
    term_put_tuple_element(return_tuple, 1, OK_ATOM);

    send_message(pid, return_tuple, glb);

    free(tcp_data);
    scheduler_terminate(ctx);
}

static void do_recvfrom(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    if (socket_data->passive_receiver_process_pid != term_invalid_term()) {
        // 3 (error_tuple) + 3 (result_tuple)
        if (UNLIKELY(memory_ensure_free(ctx, 3 + 3) != MEMORY_GC_OK)) {
            abort();
        }

        term ealready = context_make_atom(ctx, ealready_atom);

        term error_tuple = term_alloc_tuple(2, ctx);
        term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
        term_put_tuple_element(error_tuple, 1, ealready);

        term result_tuple = term_alloc_tuple(2, ctx);
        term_put_tuple_element(result_tuple, 0, ref);
        term_put_tuple_element(result_tuple, 1, error_tuple);

        send_message(pid, result_tuple, glb);
    }

    if (socket_data->avail_bytes) {
        TRACE(stderr, "do_recvfrom: have already ready bytes.\n");

        struct netbuf *buf = NULL;
        err_t status = netconn_recv(socket_data->conn, &buf);
        if (UNLIKELY(status != ERR_OK)) {
            //TODO
            fprintf(stderr, "do_recvfrom: netconn_recv error: %i\n", status);
            return;
        }

        void *data;
        u16_t data_len;
        status = netbuf_data(buf, &data, &data_len);
        if (UNLIKELY(status != ERR_OK)) {
            //TODO
            fprintf(stderr, "do_recvfrom: netbuf_data error: %i\n", status);
            return;
        }

        socket_data->avail_bytes -= data_len;

        //HANDLE fragments here?

        TRACE("%*s\n", (int) data_len, (char *) data);

        int recv_terms_size;
        if (socket_data->binary) {
            recv_terms_size = term_binary_data_size_in_terms(data_len) + BINARY_HEADER_SIZE;
        } else {
            recv_terms_size = data_len * 2;
        }

        // 4 (recv_ret size) + 3 (ok_tuple size) + 3 (result_tuple size) + recv_terms_size
        if (UNLIKELY(memory_ensure_free(ctx, 4 + 3 + 3 + recv_terms_size) != MEMORY_GC_OK)) {
            abort();
        }

        term recv_data;
        if (socket_data->binary) {
            recv_data = term_create_uninitialized_binary(data_len, ctx);
            memcpy((void *) term_binary_data(recv_data), data, data_len);
        } else {
            recv_data = term_from_string((const uint8_t *) data, data_len, ctx);
        }

        term addr = socket_addr_to_tuple(ctx, netbuf_fromaddr(buf));
        term port = term_from_int32(netbuf_fromport(buf));

        netbuf_delete(buf);

        term recv_ret = term_alloc_tuple(3, ctx);
        term_put_tuple_element(recv_ret, 0, addr);
        term_put_tuple_element(recv_ret, 1, port);
        term_put_tuple_element(recv_ret, 2, recv_data);

        term ok_tuple = term_alloc_tuple(2, ctx);
        term_put_tuple_element(ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(ok_tuple, 1, recv_ret);

        term result_tuple = term_alloc_tuple(2, ctx);
        term_put_tuple_element(result_tuple, 0, ref);
        term_put_tuple_element(result_tuple, 1, ok_tuple);

        send_message(pid, result_tuple, glb);

    } else {
        socket_data->passive_receiver_process_pid = pid;
        socket_data->passive_ref_ticks = term_to_ref_ticks(ref);
    }
}

static void do_get_port(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    // 3 (error_ok_tuple) + 3 (result_tuple)
    if (UNLIKELY(memory_ensure_free(ctx, 3 + 3) != MEMORY_GC_OK)) {
        abort();
    }

    term error_ok_tuple = term_alloc_tuple(2, ctx);
    if (socket_data->port != 0) {
        term_put_tuple_element(error_ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(error_ok_tuple, 1, term_from_int(socket_data->port));
    } else {
        term_put_tuple_element(error_ok_tuple, 0, ERROR_ATOM);
        term_put_tuple_element(error_ok_tuple, 1, BADARG_ATOM);
    }

    term result_tuple = term_alloc_tuple(2, ctx);
    term_put_tuple_element(result_tuple, 0, ref);
    term_put_tuple_element(result_tuple, 1, error_ok_tuple);

    send_message(pid, result_tuple, glb);
}

static void do_sockname(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    ip_addr_t addr;
    u16_t port;
    err_t result = netconn_addr(socket_data->conn, &addr, &port);
    term return_msg;
    if (result != ERR_OK) {
        if (UNLIKELY(memory_ensure_free(ctx, 3 + 3) != MEMORY_GC_OK)) {
            abort();
        }
        return_msg = term_alloc_tuple(2, ctx);
        term_put_tuple_element(return_msg, 0, ERROR_ATOM);
        term_put_tuple_element(return_msg, 1, term_from_int(result));
    } else {
        if (UNLIKELY(memory_ensure_free(ctx, 3 + 3 + 8) != MEMORY_GC_OK)) {
            abort();
        }
        return_msg = term_alloc_tuple(2, ctx);
        term addr_term = socket_addr_to_tuple(ctx, &addr);
        term port_term = term_from_int(port);
        term address_port_term = term_alloc_tuple(2, ctx);
        term_put_tuple_element(address_port_term, 0, addr_term);
        term_put_tuple_element(address_port_term, 1, port_term);
        term_put_tuple_element(return_msg, 0, OK_ATOM);
        term_put_tuple_element(return_msg, 1, address_port_term);
    }

